app/controllers/comments_controller.rb

	def create
		if Shoe.find(params[:shoe_id]).comments += [current_user.comments.new(comment_params)]
---
SELECT "comments".* FROM "comments" WHERE "comments"."shoe_id" = ?  [["shoe_id", 5]]
SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT 1  [["id", "5"]]