app/controllers/shoes_controller.rb

SELECT "shoes".* FROM "shoes"
---
	def new
		@shoe = Shoe.new
	  	@shoes = Shoe.all

SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."shoe_id" = ? ORDER BY created_at DESC  [["shoe_id", 1]]
---
	def show
		@shoe = Shoe.find(params[:id])
		@comment = Comment.new
		@comments = @shoe.comments.order("created_at DESC")

SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "shoes" WHERE "shoes"."id" = ?  [["id", 1]]
---
	def destroy
		@shoe = Shoe.find(params[:id])
		@shoe.destroy