app/views/shoes/show.html.erb

<% @comments.each do |comment| %>
	<h5><%= comment.user.first_name %></h5>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]